Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: སྟེང་དུ་འཛེགས་ནས་ཡལ་ག་དང་ལོ་མ་བཅད་དེ་བསིལ་གྲིབ་བྱས་སོ།
en: He climbed it, cut off branches and leaves, and created a shade for the fish. “

source: །གཞན་ཡང་རྫིང་འདིའི་ཆུ་གང་ནས་འོངས་ཞེས་ཡོངས་སུ་བཙལ་བ་ལས་ཆུ་བོ་ཆེན་པོ་ཆུ་སྐྱེས་ཞེས་བྱ་བ་ཞིག་མཐོང་ངོ་།
en: Moreover, he searched for the source of the water that fed this lake and saw a great river called Jalāgamā.

source: །དེའི་ཚེ་ཆུ་བོ་དེའི་འགྲམ་ན་ཉ་པ་མང་པོ་ཡོད་པས་ཉ་བླང་བའི་ཕྱིར་ཆུ་བོ་དེའི་གོང་དུ་གཡང་ས་ཆེན་པོ་ཡོད་པའི་གནས་སུ་ཆུ་བོ་ནས་འབབ་ཏུ་མི་སྟེར་བས་ཆུ་དྲལ་བའི་གནས་དེ་ཡང་ཤིན་ཏུ་བཅོས་དཀའ་བར་གྱུར་པས་འདི་སྙམ་དུ་གང་བ་འདི་ནི་ཤིན་ཏུ་ཟབ་ཅིང་གཡང་ས་ཆེ་བས་མི་བརྒྱ་སྟོང་གིས་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཡང་གཅོད་པར་མི་ནུས་ན་བདག་གཅིག་པུས་ནུས་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་སྙམ་མོ།
en: At that time, there were many fishermen on the banks of that river, and in order to obtain those fish they had stopped the river from flowing onward in a place upstream where there was a great precipice. It would be so difficult to correct where the river had been diverted that he thought, ‘This is such a great, deep precipice, not even a hundred thousand men working for three months would be able to cut through it, so it goes without saying that I could not do so on my own.’ “

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མྱུར་དུ་རང་གི་གྲོང་ཁྱེར་དུ་སོང་སྟེ་རྒྱལ་པོ་ཆེན་པོའི་དྲུང་དུ་ཕྱིན་ནས་མགོ་བོས་རྐང་པ་ལ་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་གུས་པས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་དུ་བདག་གིས་རྒྱལ་པོ་ཆེན་པོའི་མངའ་རིས་ན་འབངས་ལ་བྲོ་ནད་སྣ་ཚོགས་ཅི་མཆིས་པ་གསོས་ནས། ཐམས་ཅད་བདེ་བར་བགྱིས་ཏེ། མཐར་གྱིས་ལྗོངས་རྒྱུར་མཆིས་པ་ལས་འབྲོག་དགོན་པ་ཞིག་ཏུ་མཆིས་པ་དང་།
en: Then the head merchant’s son quickly returned to his town and went before King Sureśvaraprabha, bowed down his head to his feet, seated himself to one side, and, with his palms together in reverence, said, ‘I healed the various illnesses of the subjects in the great king’s domain such that they were all happy, and while proceeding throughout the land, I came to a wilderness.

source: རྫིང་དགོན་པ་ཆུ་སྐྱེས་ཞེས་བགྱི་བ་དེའི་ཆབ་བས་སུ་ཉེ་བས་དེ་ན་ཉ་སྟོང་ཕྲག་བཅུ་མཆིས་པ་ཡང་གདུགས་ཀྱིས་སྐམས་པས་རིང་པོ་མི་ཐོགས་པར་འགུམ་པར་འགྱུར་བ་དག་མཐོང་ལགས་ན།
en: There I saw a lake called Aṭavīsaṃbhavā, the water of which had almost completely disappeared, and in it were ten thousand fish that would soon die from being dried up by the sun.

source: རྒྱལ་པོ་ཆེན་པོ་བྱམས་པ་དང་ཐུགས་རྗེས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་གླང་པོ་ཆེ་ཉི་ཤུ་ཞིག་ཆབ་དགལ་བར་སྐད་ཅིག་སྩལ་དུ་གསོལ།
en: Great king! Look upon me with love, compassion, and kindness and bestow upon me for a while twenty elephants for carrying water.

source: །ཇི་ལྟར་བདག་གིས་ནད་པ་མང་པོ་དག་ལ་སྲོག་སྩལ་བ་དེ་བཞིན་དུ་ཉ་དེ་དག་གི་སྲོག་གི་སྐྱབས་བགྱིད་པ་ལགས་སོ་ཞེས་གསོལ་ཏོ།
en: Just as I saved the lives of many ill people, so I will save the lives of those fish.’ “

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོས་ཀྱང་བློན་པོ་ཆེན་པོ་ལ་སྨན་པའི་རྒྱལ་པོ་འདི་ལ་མྱུར་དུ་གླང་པོ་ཆེ་བྱིན་ཅིག་ཅེས་བསྒོའོ།
en: The great king then commanded the prime minister, ‘Quickly provide this king of doctors with elephants!’ “

source: །དེའི་ཚེ་བློན་པོ་ཆེན་པོས་ཀྱང་རྒྱལ་པོའི་བཀའ་ཁྱེར་ནས་ཚོང་དཔོན་གྱི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་སྐྱེས་བུ་ཆེན་པོ་ལེགས་སོ།
en: At that time, the prime minister, obeying the king’s command, said to the head merchant’s son, ‘O great being!

source: །ཁྱོད་བདག་ཉིད་གླང་པོ་ཆེའི་ལྷས་སུ་སོང་སྟེ། ཡིད་ལ་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་གླང་པོ་ཆེ་ཉི་ཤུ་ཞིག་འདམས་ཏེ་ཁྱེར་ལ་སེམས་ཅན་ལ་ཕན་བཏགས་ནས་བདེ་བ་ཐོབ་པར་གྱིས་ཤིག །
en: Go to the elephant pen yourself, choose the twenty elephants that you want, and take them and bring benefit to beings so that they will gain happiness.’ “

source: དེ་ནས་ཆུ་འབེབས་བུ་གཉིས་དང་ལྷན་ཅིག་ཏུ་གླང་པོ་ཆེ་ཉི་ཤུ་ཁྲིད་དེ་ཆང་པའི་ཁྱིམ་ནས་རྐྱལ་པ་མང་པོ་གཡར་ཏེ། ཆུ་དྲལ་བའི་གནས་སུ་ཕྱིན་ནས་རྐྱལ་པ་ཆུས་བཀང་སྟེ་གླང་པོ་ཆེ་ལ་བཀལ་ནས་རྫིང་གི་དྲུང་དུ་ཕྱིན་ཏེ། རྫིང་གི་ནང་དུ་བླུགས་པ་དང་སྔ་མཁོ་བཞིན་དུ་གང་ཞིང་རྒྱས་པར་གྱུར་ཏོ།
en: Then Jalavāhana, with his two sons, took away twenty elephants, borrowed many bags from a tavern, went to where the river was interrupted, filled the bags with water, loaded them onto the elephants, brought them to the lake, and emptied them into the lake, so that it became full and vast as before. “

source: །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་ཚོང་དཔོན་གྱི་བུས་རྫིང་གི་ངོས་བཞིར་འཁོར་བར་བལྟས་པ་དང་། དེ་ནས་ཉ་མང་པོ་དེ་དག་ཀྱང་ཕྱི་བཞིན་འབྲངས་ནས་འགྲམ་དུ་རྒྱུ་བར་གྱུར་ཏོ།
en: Noble goddess, at that time, the head merchant’s son walked around the four sides of the lake, looking at it, and many fish followed him, milling around at the shore.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ཡང་འདི་སྙམ་དུ་ཉ་མང་པོ་འདི་དག་ཅིའི་ཕྱིར་བདག་གི་ཕྱི་བཞིན་འབྲང་།
en: Then the head merchant’s son thought, ‘Why are these fish following me?

source: གདོན་མི་ཟ་བར་བཀྲེས་པའི་མེས་གདུངས་ནས་བདག་ལ་ཟས་སློང་བ་ཡིན་པས་བདག་གིས་སྦྱིན་པར་བྱའོ་སྙམ་དུ་བསམས་ནས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: No doubt it is because they are tormented by the fire of hunger and are begging me for food, so I shall give it to them.’ “

source: །ཁྱོད་ཀྱིས་གླང་པོ་ཆེ་མཆོག་ཏུ་སྟོབས་དང་ལྡན་པ་ཞིག་བླངས་ཏེ་མྱུར་དུ་ཁྱིམ་དུ་དེང་ལ་ཡབ་ཚོང་དཔོན་ལ་གསོལ་ཏེ། ཁྱིམ་ན་བཟར་རུང་བའི་དངོས་པོ་ཅི་ཡོད་པ་དང་། ཕ་མ་ཟ་བའི་སྐལ་བ་དང་། བུ་དང་ཆུང་མ་དང་། བྲན་དང་།
en: Jalavāhana, the head merchant’s son, then said to his sons, ‘Take the strongest elephant and quickly go home and tell my father, the head merchant, to gather together everything there is to eat in the house—that which is intended for my parents and that which is intended for my wife, children, male servants, and female servants—and bring it to me.’ “

source: བྲན་མོའི་སྐལ་བ་ཅི་ཡོད་པ་ཐམས་ཅད་ཀྱང་བསྡུས་ཏེ་ཁྱེར་ལ་ཤོག་ཤིག །དེ་ནས་བུ་གཉིས་ཕའི་བསྟན་པ་མཉན་ནས་གླང་པོ་ཆེ་མཆོག་ལ་ཞོན་ཏེ། རིངས་པར་ཁྱིམ་དུ་སོང་ནས་མེས་པོའི་དྲུང་དུ་ཕྱིན་པ་དང་། དངོས་པོ་གོང་མ་རྒྱས་པར་སྨྲས་ནས་ཁྱིམ་ན་བཟར་རུང་བའི་དངོས་པོ་ཅི་ཡོད་པ་བླངས་ཏེ་གླང་པོ་ཆེ་ལ་བཀལ་ནས་མྱུར་ཞིང་རིངས་པར་ཕ་འདུག་པའི་རྫིང་དྲུང་དུ་ཕྱིན་པ་དང་།
en: Then the two sons, obeying their father, rode the strongest elephant, hurried home, went before their grandfather, and said in detail what they had been told to say, obtained everything that was edible in the house, quickly loaded it onto the elephant, and hurriedly went back to their father beside the lake. “

source: དེ་ནས་ཆུ་འབེབས་བུ་འོངས་པ་མཐོང་ནས་ལུས་དང་སེམས་དགའ་མགུ་རངས་པར་གྱུར་ཏེ།
en: When Jalavāhana saw them coming, his body and mind were filled with happiness, delight, and joy.

source: ཟས་རྣམས་བླངས་ནས་རྫིང་ཀུན་དུ་ཁྱབ་པར་གཏོར་བ་དང་།
en: He took the food and scattered it throughout the lake.

source: ཉ་རྣམས་ཟས་ཐོབ་པ་དང་ཐམས་ཅད་འགྲངས་ཤིང་ཚིམ་པར་གྱུར་ཏོ།
en: The fish obtained the food, and they were all filled and satiated. “

source: །ཡང་འདི་སྙམ་དུ་དེང་བདག་གིས་ཟས་ཡོངས་སུ་བཏང་ནས་ཉ་རྣམས་སྲོག་ཐོབ་པར་གྱུར་པས་མ་འོངས་པའི་དུས་ཀྱི་ཚེ་ཡང་ཆོས་ཀྱི་ཟས་ཡོངས་སུ་བཏང་ནས་སེམས་ཅན་མཐའ་ཡས་པ་རྣམས་ཚིམ་པར་བྱེད་པར་གྱུར་ཅིག་སྙམ་མོ།
en: Then he thought, ‘I have given the fish food and saved their lives. In the future, may I give the food of the Dharma and satisfy an infinite number of beings!’ “

source: །གཞན་ཡང་འདི་སྙམ་དུ་བདག་གིས་སྔོན་དགོན་པའི་ནགས་ཚལ་ན་དགེ་སློང་ཞིག་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་ཀློག་པ་ལས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་པའི་ཆོས་ཟབ་མོའི་དོན་གཅེས་པ་སྟོན་པ་ཡང་མཐོང་ཞིང་ཐོས།
en: He also thought, ‘In the past, in a solitary forest, I saw and listened to a bhikṣu who was reading from a Mahāyāna sūtra that was teaching the profound Dharma of the twelve phases of dependent origination.

source: གཞན་ཡང་མདོ་སྡེ་ལས་སེམས་ཅན་གང་ལ་ལ་ཞིག་འཆི་ཀའི་དུས་ཀྱི་ཚེ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཕུད་ཀྱི་མཚན་ཐོས་པར་གྱུར་ན་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་རོ་ཞེས་གསུངས་པས།
en: Moreover, he also taught from that sūtra that anyone who hears the name of the Tathāgata Ratnaśikhin at the time of their death will be reborn in a higher existence.

source: དེང་བདག་གིས་ཉ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་ལ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་པའི་ཆོས་ཟབ་མོ་ཡང་བསྟན་ལ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཕུད་ཀྱི་མཚན་ཡང་བརྗོད་པར་བྱའོ།
en: Therefore, today I will teach the fish the profound Dharma of dependent origination, and I will also recite the name of the Tathāgata Ratnaśikhin.

source: །འཛམ་བུའི་གླིང་འདི་ན་སེམས་ཅན་རྣམ་པ་གཉིས་ཡོད་དེ། ཐེག་པ་ཆེན་པོ་ལ་ཤིན་ཏུ་མངོན་པར་ཡིད་ཆེས་པ་དང་། ཡིད་མི་ཆེས་ཤིང་སྨོད་པར་བྱེད་པ་སྟེ། དེ་དག་ཀྱང་མངོན་པར་ཡིད་ཆེས་པའི་སེམས་འཕེལ་བར་བྱའོ་སྙམ་མོ།
en: There are two kinds of beings in this Jambudvīpa: those who have complete faith in the Mahāyāna, and those who do not believe in it and disparage it, and so I will increase those who in their minds have belief in it.’ “

source: །དེའི་ཚེ་ཚོང་དཔོན་གྱི་བུ་འདི་སྙམ་དུ་བདག་རྫིང་གི་ནང་དུ་ཞུགས་ཏེ་ཉ་མང་པོ་དེ་དག་ལ་ཆོས་ཟབ་མོ་ཤིན་ཏུ་གྱ་ནོམ་པ་བཤད་པར་བྱའོ་སྙམ་དུ་བསམས་ནས་ཆུའི་ནང་དུ་ཞུགས་ཏེ།
en: At that moment, the head merchant’s son thought, ‘I will enter this lake and I will teach the extremely wonderful profound Dharma to these many fish!’ Having thought that, he entered the water. “

source: འདི་སྐད་ཅེས་འདས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པའི་སྐྱེས་བུ་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: He recited, ‘I pay homage to the past Tathāgata Arhat Samyaksaṃbuddha, the one with wisdom and virtuous conduct, the sugata, the knower of the world, the unsurpassable being, the guide who tames beings, the teacher of devas and humans, the buddha, the Bhagavat Ratnaśikhin!

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་ཆེན་གཙུག་ཕུད་ལ་ཕྱག་འཚལ་ལོ། །དེ་བཞིན་གཤེགས་པ་འདི་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་འདི་ལྟར་ཐུགས་དམ་བཞེས་ཏེ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ཇི་སྙེད་པ་གང་དག་འཆི་ཀའི་དུས་ཀྱི་ཚེ་ངའི་མིང་ཐོས་པར་གྱུར་ན་ཤི་འཕོས་པའི་འོག་ཏུ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷར་སྐྱེ་བར་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་ཏོ་ཞེས་བསྒྲགས་སོ།
en: Previously, when this tathāgata was practicing bodhisattva conduct, he made this commitment: “May anyone in the world realms in the ten directions who hears my name at the time of their death, after passing away, be reborn as a deva in Trāyastriṃśa.” ’ “

source: །དེ་ནས་ཆུ་འབེབས་ཀྱིས་རྫིང་གི་ཉ་དེ་དག་ལ་ཆོས་ཟབ་མོ་གྱ་ནོམ་པ་ཡང་འདི་སྐད་དུ་འདི་ཡོད་པའི་ཕྱིར་དེ་ཡོད། འདི་སྐྱེས་པའི་ཕྱིར་དེ་སྐྱེ་བར་འགྱུར་བ་འདི་ལྟ་སྟེ། མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད། འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: Jalavāhana then taught those fish the wonderful, profound Dharma with these words: ‘Because this exists, that exists; because this is produced, that is produced.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས། མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ། རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ། ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ། སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ། ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ། སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ། སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་།
en: Thus, because of the factor of ignorance, there is formation; because of the factor of formation, there is consciousness; because of the factor of consciousness, there is name-and-form; because of the factor of name-and-form, there are the six āyatanas; because of the factor of the six āyatanas, there is contact; because of the factor of contact, there is sensation; because of the factor of sensation, there is craving; because of the factor of craving, there is grasping; because of the factor of grasping, there is becoming; because of the factor of becoming, there is birth; because of the factor of birth, there is old age, death, misery, lamentation, suffering, and distress.

source: མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། འཁྲུག་པ་འབྱུང་སྟེ། སྡུག་བསྔལ་གྱི་ཕུང་པོ་འདི་འབའ་ཞིག་འབྱུང་བར་འགྱུར་རོ།
en: In that way is produced this great mass of nothing but suffering. “ ‘

source: །འདི་འགགས་པའི་ཕྱིར་དེ་འགག་པར་འགྱུར་བ་འདི་ལྟ་སྟེ། མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག །འདུ་བྱེད་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག །རྣམ་པར་ཤེས་པ་འགགས་པས་མིང་དང་གཟུགས་འགག །
en: If this ceases, then that ceases.

source: མིང་དང་གཟུགས་འགགས་པས་སྐྱེ་མཆེད་དྲུག་འགག །སྐྱེ་མཆེད་དྲུག་འགགས་པས་རེག་པ་འགག །རེག་པ་འགགས་པས་ཚོར་བ་འགག །ཚོར་བ་འགགས་པས་སྲེད་པ་འགག །སྲེད་པ་འགགས་པས་ལེན་པ་འགག །ལེན་པ་འགགས་པས་སྲིད་པ་འགག །སྲིད་པ་འགགས་པས་སྐྱེ་བ་འགག །སྐྱེ་བ་འགགས་པས་རྒ་ཤི་འགག །རྒ་ཤི་འགགས་པས་མྱ་ངན་དང་།
en: Thus, through the cessation of ignorance, formation ceases; through the cessation of formation, consciousness ceases; through the cessation of consciousness, name-and-form ceases; through the cessation of name-and-form, the six āyatanas cease; through the cessation of the six āyatanas, contact ceases; through the cessation of contact, sensation ceases; through the cessation of sensation, craving ceases; through the cessation of craving, grasping ceases; through the cessation of grasping, becoming ceases; through the cessation of becoming, birth ceases; through the cessation of birth, old age and death cease; through the cessation of old age and death, misery, lamentation, suffering, and distress cease.

source: སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། འཁྲུག་པ་རྣམས་འགག་པར་འགྱུར་ཏེ། འདི་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་འདི་འབའ་ཞིག་འགག་པར་འགྱུར་རོ་ཞེས་བཤད་དོ། །ཆོས་འདི་དག་བཤད་ནས་གཞན་ཡང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་དང་མཚུངས་པར་ལྡན་པའི་གཟུངས་འདི་བསྟན་ཏོ། །ཏདྱ་ཐཱ། བི་ཙ་ནི། བི་ཙ་ནི། བི་ཙ་ནི། སཾཤྩ་ནི། སཾཤྩ་ནི། སཾཤྩ་ནི། བྷི་ཤི་ནི། བྷི་ཤི་ནི། བྷི་ཤི་ནི་སྭཱ་ཧཱ། ཏདྱ་ཐཱ། ན་མི་ནི། ན་མི་ནི། ན་མི་ནི། ཤ་དྷི་ནི། ཤ་དྷི་ནི། ཤ་དྷི་ནི། སྲ་པྲ་ཤི་ནི། སྲ་པྲ་ཤི་ནི། སྲ་པྲ་ཤི་ནི་སྭཱ་ཧཱ། ཏདྱ་ཐཱ། བེ་ཏྲ་ནི། བེ་ཏྲ་ནི། བེ་ཏྲ་ནི། ཏྲི་ཤི་ནི་ནི། ཏྲི་ཤི་ནི་ནི། ཏྲི་ཤི་ནི་ནི། ཨུ་པ་དྷི་ནི། ཨུ་པ་དྷི་ནི། ཨུ་པ་དྷི་ནི་སྭཱ་ཧཱ། ཏདྱ་ཐཱ། བྷ་བི་ནི། བྷ་བི་ནི། བྷ་བི་ནི། ཤ་ཏི་ནི། ཤ་ཏི་ནི།
en: In that way, this great mass of nothing but suffering will cease.’ “

source: ཤ་ཏི་ནི། ཤ་མ་ནི་ནི། ཤ་མ་ནི་ནི། ཤ་མ་ནི་ནི་སྭཱ་ཧཱ། དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་མང་པོ་རྣམས་ལ་ཚོང་དཔོན་གྱི་བུའི་སྔོན་གྱི་རྒྱུ་འདི་བསྟན་པ་ན་ལྷ་དང་མིའི་འཁོར་རྣམས་ཀྱིས་ཤིན་ཏུ་ངོ་མཚར་ཆེའོ་ཞེས་བསྔགས་པ་བརྗོད་པར་གྱུར་ཏོ།
en: Having taught this Dharma, he then also taught the dhāraṇī that is the same as the twelve phases of dependent origination: tadyathā vicani vicani vicani saṃścani saṃścani saṃścani bhiśini bhiśini bhiśini, svāhā | tadyathā nimini nimini nimini śadhini śadhini śadhini sapraśini sapraśini sapraśini svāhā | tadyathā vetrani vetrani vetrani triśinini triśinini triśinini upadhini upadhini upadhini svāhā | tadyathā bhavini bhavini bhavini satini satini satini samanini samanini samanini svāhā | At that time, when the Bhagavat taught the past causes of the head merchant’s son to the great assembly, the assembly of devas and humans was greatly amazed and praised him.

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་སོ་སོ་ནས་གནས་དེ་ཉིད་དུ་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the Four Mahārājas, each from their individual place, said in one voice: “Excellent!

source: །ལེགས་སོ་ཤཱཀྱ་ཐུབ་པའི་གཙོ། །ཡན་ལག་བཅུ་གཉིས་མཚུངས་ལྡན་པ། །དམ་ཆོས་རིག་སྔགས་བཀས་བཤད་ནས། །སྡིག་བསལ་བསོད་ནམས་འཕེལ་བར་མཛད། །བདག་ཅག་ཀྱང་ནི་སྔགས་བརྗོད་ནས།
en: Śākya Lord of Munis, you have Eliminated bad karma and increased merit By teaching the Dharma of the vidyāmantra That is the same as the twelve phases. “

source: །དམ་པའི་ཆོས་ནི་སྲུང་བར་བགྱིད། །གང་ཞིག་འགལ་བར་བགྱིས་ནས་ནི། །ལེགས་པར་རྗེས་སུ་མི་འབྲང་ན། །ཨརྫ་ཀ་ཡི་ཡལ་ག་བཞིན། །མགོ་ནི་ཚལ་པ་བདུན་དུ་འགས།
en: We also, if a mantra is recited, Will give protection to the Dharma, And if someone acts contrary to it And does not follow it well, “That person’s head will burst into seven parts Like the top of a basil plant.

source: །བདག་ཅག་བཅོམ་ལྡན་སྤྱན་སྔར་ནི། །རིག་སྔགས་ལན་ཅིག་བརྗོད་པར་བགྱི། །ཏདྱ་ཐཱ། ཧི་རི་མི་གཱ་ཏེ། གནྡྷ་རི། ཙནྡྷ་རི། དྷ་རི་ཛེ་བྷ་རེ། ཤི་ཧི་བྷ་རི། པུ་རེ་པུ་རེ། གུ་གུ་མ་ཏི། ཁི་ར་མ་ཏི། དྷ་དྷི་མུ་ཁི། ལཽ་རུ་བྷ། མུ་རུ་བྷི། ཀུ་ཙ་མུ་རུ་གནྟེ། ཏུ་རུ་ཏུ་རུ་ཏུ་རུ་བཱི་རྱེ། ཨ་དྷི་སིདྡྷི། ད་བ་བྱེ། དྷ་ད་བ་བྱེ། ཨུསྟེ། ཨུ་སྟ་བད་དྷེ།
en: We will recite the vidyāmantra Once in the presence of the Bhagavat.

source: ཨན་ལེ་བད་དྷེ། པ་དུ་མ་བད་དྷེ། ཨ་སུ་མ་བད་དྷེ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་དང་བུ་གཉིས་ཀྱིས་རྫིང་དེའི་ཉ་དག་ལ་ཆུ་དང་ཟས་བྱིན་ནས་ཆོས་བཤད་དེ་སླར་རང་གི་ཁྱིམ་དུ་དོང་ངོ་།
en: tadhyathā hirimigāte gandhari candhari dharijebhare śihibhari pure pure gugumti khiramati dhadhimukhi laurubha murubhi kucumurugandhe turu turu turu vīrye adhisiddhi davabbye dhadavabye uste ustabaddhe anle badhe padumabaddhe asumabaddhe svāhā | The Bhagavat continued, “Noble goddess, Jalavāhana, the head merchant’s son, and his two sons, having given water and food to the fish and taught them the Dharma, returned to their home. “

source: །ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་དེ་དུས་གཞན་ཞིག་ན་སྟོན་མོ་ལ་འདུས་ཏེ། སྟོན་མོ་སྣ་ཚོགས་བྱས་ནས་ཆང་གིས་ར་རོ་སྟེ་ཉལ་བ་དང་།
en: At another time, Jalavāhana, the head merchant’s son, held a feast, and after various entertainments, intoxicated from alcohol, he fell asleep.

source: དེའི་ཚེ་ཉ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་དུས་གཅིག་ཏུ་ཚེ་འདས་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷར་སྐྱེས་པས།
en: At that time, the ten thousand fish all passed away at the same moment and were reborn as devas in Trāyastriṃśa.

source: དེ་དག་འདི་སྙམ་དུ་བདག་ཅག་དགེ་བའི་ལས་ཀྱི་རྒྱུ་དང་རྐྱེན་གང་གིས་ལྷའི་གནས་འདིར་སྐྱེས་པར་གྱུར་ཅེས་བསམས་ནས་ཕན་ཚུན་གཅིག་ལ་གཅིག་འདི་སྐད་དུ་བདག་ཅག་ནི་སྔོན་འཛམ་བུའི་གླིང་དུ་དུད་འགྲོའི་སྐྱེ་གནས་སུ་ལྷུང་ནས་ཉའི་ལུས་བླངས་པ་ལས།
en: They wondered, ‘Through what good karma as a cause and condition have we been reborn in this paradise?’

source: ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས་བདག་ཅག་ལ་ཆུ་དང་ཟས་བྱིན་ནས། གཞན་ཡང་བདག་ཅག་ལ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་པའི་ཆོས་ཟབ་མོ་དང་གཟུངས་ཀྱང་བཤད།
en: and then they said to each other, ‘We had fallen into an animal rebirth in Jambudvīpa and had obtained the bodies of fish, but Jalavāhana, the head merchant’s son, gave us water and food, and moreover he taught us the profound Dharma and the dhāraṇī of the twelve phases of dependent origination.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཕུད་ཀྱི་མཚན་ནས་ཀྱང་བརྗོད་པའི་རྒྱུ་དང་རྐྱེན་དེས་བདག་ཅག་ལྷའི་གནས་འདིར་སྐྱེས་པ་ཡིན་པས།
en: He also recited the name of the Tathāgata Ratnaśikhin, and it is through those causes and conditions that we have been reborn in this paradise.

source: དེའི་ཕྱིར་བདག་ཅག་ཐམས་ཅད་ཚོང་དཔོན་གྱི་བུ་དེའི་ཐད་དུ་དོང་ལ་དྲིན་བསབ་པའི་ཕྱིར་མཆོད་པ་བྱ་བའི་རིགས་སོ་ཞེས་སྨྲས་སོ།
en: Therefore, we should go to Jalavāhana, the head merchant’s son, and make offerings to him to repay his kindness.’ “

source: །དེ་ནས་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་ལྷའི་གནས་དེ་ནས་མི་སྣང་བར་གྱུར་ཏེ་འཛམ་བུའི་གླིང་དུ་སྨན་པའི་རྒྱལ་པོ་ཆེན་པོའི་ཐད་དུ་ལྷགས་སོ།
en: Those ten thousand devas then vanished from that paradise and arrived beside the king of healing in Jambudvīpa. “

source: །དེའི་ཚེ་ཚོང་དཔོན་གྱི་བུ་དེ་ཡང་ཐོག་མཐོན་པོའི་སྟེང་དུ་བདེ་བར་གཉིད་ལོག་པ་ལས་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་གིས་མུ་ཏིག་གི་ཕྲེང་བ་སྟོང་ཕྲག་བཅུ་ནི་མགོ་དྲུང་དུ་བཞག །ཡང་སྟོང་ཕྲག་བཅུ་ནི་རྐང་པའི་དྲུང་དུ་བཞག །
en: At that time, the head merchant’s son was sleeping happily upon a high roof, and those ten thousand devas placed ten thousand pearl necklaces above his head. They also placed a hundred thousand pearl necklaces in front of his feet.

source: ཡང་སྟོང་ཕྲག་བཅུ་ནི་གཡས་ཕྱོགས་སུ་བཞག །
en: They also placed a hundred thousand pearl necklaces to his right.

source: ཡང་སྟོང་ཕྲག་བཅུ་ནི་གཡོན་ཕྱོགས་སུ་བཞག་སྟེ།
en: They also placed a hundred thousand pearl necklaces to his left.

source: མེ་ཏོག་མནྡཱ་ར་བ་དང་། མནྡཱ་ར་བ་ཆེན་པོའི་ཆར་པུས་ནུབ་ཙམ་དུ་ཕབ་ནས་འོད་ཀྱིས་ཀུན་དུ་སྣང་བར་བྱས་ཏེ།
en: They sent down a rain of coral tree flowers and great coral tree flowers to a depth that would reach the knees and radiate everywhere.

source: ལྷའི་རོལ་མོ་རྣམ་པ་སྣ་ཚོགས་ལས་སྒྲ་དབྱངས་སྙན་པ་དག་བྱུང་བས་འཛམ་བུའི་གླིང་དུ་གཉིད་ལོག་པ་ཐམས་ཅད་སད་པར་བྱས་སོ།
en: The melodious sounds of various kinds of divine music resounded, and everyone who was asleep in Jambudvīpa woke up.

source: །ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱང་གཉིད་ལོག་པ་ལས་སད་པར་གྱུར་པ་དང་།
en: Jalavāhana, the head merchant’s son, was also awoken from his sleep.

source: དེ་ནས་ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་གིས་མཆོད་པ་བྱས་ནས་ནམ་མཁའ་ལ་འཕུར་ཏེ་དོང་ངོ་།
en: Then those ten thousand devas, having made their offerings, flew into the sky and departed. “

source: །རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་གི་འོད་ཀྱི་ཡུལ་ཁམས་སུ་ཡང་གནས་དེ་དང་དེ་དག་ཐམས་ཅད་དུ་ལྷའི་མེ་ཏོག་པདྨ་དམ་པའི་ཆར་མངོན་པར་ཕབ་བོ།
en: They let fall a rain of excellent lotuses here and there throughout the domain of King Sureśvaraprabha.

source: །ལྷའི་བུ་མང་པོ་དེ་དག་སྔོན་གྱི་གནས་དགོན་པའི་རྫིང་དྲུང་དུ་དོང་ནས་ལྷའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་མངོན་པར་ཕབ་སྟེ། དེ་ནས་མི་སྣང་བར་གྱུར་ནས་སླར་ལྷའི་གནས་སུ་དོང་སྟེ། ཡིད་བཞིན་དུ་ཅི་དགའ་བར་འདོད་པ་ལྔའི་བདེ་བ་དག་ལ་ལོངས་སྤྱོད་པར་གྱུར་ཏོ།
en: Then they returned to their previous abode, to the lake in the wilderness, and sent down a rain of various kinds of divine flowers, and then they vanished and returned to paradise, where they enjoyed the bliss of whatever sensory pleasures they delighted in and wished for. “

source: །རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་གི་འོད་ཀྱང་ནམ་ལངས་པ་དང་བློན་པོ་ཆེན་པོ་དེ་དག་ལ་མདང་སུམ་རྒྱུ་དང་རྐྱེན་གང་གི་ཕྱིར་ཡ་མཚན་གྱི་མཚན་མ་དེ་ལྟ་བུ་དག་སྣང་ཞིང་འོད་ཟེར་ཆེན་པོ་དག་ཀྱང་བཀྱེ་བར་གྱུར་ཅེས་སྨྲས་སོ།
en: At daybreak, King Sureśvaraprabha asked his prime ministers, ‘What is the cause and condition whereby last night there appeared such wonderful signs and there shone a great light?’ “

source: །བློན་པོ་ཆེན་པོས་གསོལ་བ། རྒྱལ་པོ་ཆེན་པོ་མཁྱེན་པར་མཛོད་ཅིག །ལྷའི་ཚོགས་མང་པོ་རྣམས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱི་སྡུམ་པར་མུ་ཏིག་གི་ཕྲེང་བ་སྟོང་ཕྲག་བཞི་བཅུ་དང་། མེ་ཏོག་མནྡཱ་ར་བའི་ཆར་མངོན་པར་ཕབ་པ་པུས་ནུབ་ཙམ་དུ་བགྱིས་ལགས་སོ།
en: Those prime ministers answered, ‘Great king, know this: at the mansion of Jalavāhana, the head merchant’s son, a great host of devas sent down forty thousand pearl necklaces and also a rain of divine coral tree flowers to a depth that covers the knees.” “

source: །རྒྱལ་པོས་བློན་པོ་ལ་བསྒོ་བ། ཚོང་དཔོན་གྱི་ཁྱིམ་དུ་སོང་ལ་དེའི་བུ་བོས་ཤིག །
en: The king commanded the ministers, saying, ‘Go to the head merchant’s home and summon his son.’ “

source: བློན་པོ་ཆེན་པོས་བཀའ་མཉན་ནས་དེའི་ཁྱིམ་དུ་སོང་སྟེ། རྒྱལ་པོའི་བཀའ་བཟླས་ནས། ཚོང་དཔོན་གྱི་བུ་བཀུག་གོ།
en: The prime ministers obeyed the king’s command and went to his home, and there they repeated the king’s command, summoning the head merchant’s son. “

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་རྒྱལ་པོའི་དྲུང་དུ་ཕྱིན་པ་དང་། མདང་སུམ་རྒྱུ་དང་རྐྱེན་གང་གི་ཕྱིར་ཡ་མཚན་ཆེ་བའི་མཚན་མ་དེ་ལྟ་བུ་དག་བྱུང་བར་གྱུར་ཅེས་དྲིས་སོ། །ཚོང་དཔོན་གྱི་བུས་སྨྲས་པ།
en: The head merchant’s son then went before the king, who asked him, ‘What is the cause and condition whereby there appeared such wonderful signs last night?’ “

source: བདག་གིས་དཔྱད་པ་ལྟར་ན་གདོན་མི་འཚལ་བར་རྫིང་དེའི་ནང་གི་ཉ་མང་པོ་དེ་དག་མདོ་སྡེ་ལས་གསུངས་པ་བཞིན་དུ་ཚེ་འདས་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷར་སྐྱེས་པས་དེ་དག་དྲིན་ལ་ལན་གླན་པའི་སླད་དུ་ཡ་མཚན་ཆེ་བའི་མཚན་མ་དེ་ལྟ་བུ་བསྟན་སྙམ་བགྱིད་ལགས་སོ།
en: The head merchant’s son answered, ‘According to my analysis, I think that without doubt those many fish in that lake, as described in the sūtra, have passed away and been reborn as devas in Trāyastriṃśa. Therefore, in order to repay my kindness, they manifested those marvelous signs. I know that the time of death for those ten thousand fish definitely came.’ “ ‘

source: །རྒྱལ་པོས་སྨྲས་པ། ཇི་ལྟར་ཤེས། ཆུ་འབེབས་ཀྱིས་སྨྲས་པ།
en: How do you know that?’ asked the king. “ ‘

source: ལྷས་ཕོ་ཉ་འགའ་ཞིག་དང་། བདག་གི་བུ་གཉིས་རྫིང་དེའི་དྲུང་དུ་བཏང་སྟེ། ཉ་སྟོང་ཕྲག་བཅུ་པོ་དེ་གུམ་མམ་འཚོ་བརྟགས་ན་མད་དམ་མི་མད་མཁྱེན་པར་འགྱུར་ལགས་སོ།
en: Your Majesty,’ answered Jalavāhana, ‘send an emissary and my two sons to that lake, so that they can investigate whether those fish have died or are alive, and then you will know whether this is true or not.’ “

source: །རྒྱལ་པོས་དེ་སྐད་སྨྲས་པ་ཐོས་ནས་ཕོ་ཉ་དང་། དེའི་བུ་གཉིས་རྫིང་དེའི་དྲུང་དུ་བཏང་བ་ལས་རྫིང་གི་ནང་ན་མེ་ཏོག་མནྡཱ་ར་བ་མང་པོ་ཕུང་པོ་ཆེན་པོར་གྱུར་པ་དང་། ཉ་མང་པོ་ཐམས་ཅད་དུས་ལས་འདས་པར་མཐོང་ངོ་།
en: Having heard what he said, His Majesty sent an emissary and Jalavāhana’s two sons to the lake, where they saw in the lake a great mass of many coral tree flowers and that all the many fish had passed away.

source: །མཐོང་ནས་ཀྱང་སླར་མྱུར་དུ་ལོག་སྟེ་རྒྱས་པར་རྒྱལ་པོ་ལ་གསོལ་བ་དང་།
en: Having seen that, they quickly returned and related this to the king in detail. “

source: རྒྱལ་པོ་ཡང་དེ་ལྟར་གྱུར་པ་ཐོས་པས་རབ་ཏུ་དགའ་བར་གྱུར་ནས་སྔོན་ཆད་དེ་ལྟ་བུ་མ་བྱུང་ངོ་ཞེས་བསྔགས་པ་བརྗོད་པར་གྱུར་ཏོ།
en: When the king heard this, he was overjoyed and uttered words of praise, saying, ‘Never has such a wonder occurred before!’ ”
